src/debian-config.org
#+TITLE: Debian Configurations
#+DATE: <2017-07-25 Tue>
#+AUTHOR: yanyg
#+EMAIL: yygcode@gmail.com
#+OPTIONS: author:t date:t email:t

* Apt-Source配置
配置 =/etc/apt/sources.list=:
#+BEGIN_SRC conf
  deb http://httpredir.debian.org/debian jessie main contrib non-free
  #deb http://ftp.us.debian.org/debian/dists/jessie jessie main contrib
  deb-src http://httpredir.debian.org/debian jessie main contrib non-free

  deb http://httpredir.debian.org/debian jessie-updates main contrib non-free
  deb-src http://httpredir.debian.org/debian jessie-updates main contrib non-free

  deb http://security.debian.org/ jessie/updates main contrib non-free
  deb-src http://security.debian.org/ jessie/updates main contrib non-free
#+END_SRC
执行更新和安装:
#+BEGIN_SRC shell
  ~$ sudo apt-get update
  ~$ sudo apt-get install vim
#+END_SRC

* Thinkpad Trackpoint(小红点)配置
[[https://wiki.debian.org/InstallingDebianOn/Thinkpad/Trackpoint][Debian WIKI]]中配置介绍, 不同Debian配置方式有差异. 示例如下:
#+BEGIN_SRC shell
  ~$ uname -a
  Linux t400 3.16.0-4-amd64 #1 SMP Debian 3.16.43-2 (2017-04-30) x86_64 GNU/Linux
  ~$ su
  ~# cat > /usr/share/X11/xorg.conf.d/20-thinkpad.conf.1 <<EOF
  >  Section "InputClass"
  >      Identifier "Trackpoint Wheel Emulation"
  >      MatchProduct       "TPPS/2 IBM TrackPoint|DualPoint Stick|Synaptics Inc. Composite TouchPad / TrackPoint|ThinkPad USB Keyboard with TrackPoint|ThinkPad Compact USB Keyboard with TrackPoint|USB Trackpoint pointing device"
  >      MatchDevicePath    "/dev/input/event*"
  >      Option             "EmulateWheel"          "true"
  >      Option             "EmulateWheelButton"    "2"
  >      Option             "Emulate3Buttons"       "false"
  >      Option             "XAxisMapping"          "6 7"
  >      Option             "YAxisMapping"          "4 5"
  >  EndSection
  > EOF

  # comment: save all your X11 work and exit, then restart X11
  ~# /etc/init.d/gdm3 restart
#+END_SRC
[[https://wiki.archlinux.org/index.php/TrackPoint][ArchLinux]]和[[http://thinkwiki.org/wiki/How_to_configure_the_TrackPoint][thinkwiki]]也有介绍. 单击真心不好用. :)
