debian-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-29 Tue 00:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debian Configurations</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Debian Configurations</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5426bc4">1. Apt-Source配置</a></li>
<li><a href="#org956842b">2. Thinkpad Trackpoint(小红点)配置</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5426bc4" class="outline-2">
<h2 id="org5426bc4"><span class="section-number-2">1</span> Apt-Source配置</h2>
<div class="outline-text-2" id="text-1">
<p>
配置 <code>/etc/apt/sources.list</code>:
</p>
<div class="org-src-container">
<pre class="src src-conf">deb http://httpredir.debian.org/debian jessie main contrib non-free
#deb http://ftp.us.debian.org/debian/dists/jessie jessie main contrib
deb-src http://httpredir.debian.org/debian jessie main contrib non-free

deb http://httpredir.debian.org/debian jessie-updates main contrib non-free
deb-src http://httpredir.debian.org/debian jessie-updates main contrib non-free

deb http://security.debian.org/ jessie/updates main contrib non-free
deb-src http://security.debian.org/ jessie/updates main contrib non-free
</pre>
</div>
<p>
执行更新和安装:
</p>
<div class="org-src-container">
<pre class="src src-shell">~$ sudo apt-get update
~$ sudo apt-get install vim
</pre>
</div>
</div>
</div>

<div id="outline-container-org956842b" class="outline-2">
<h2 id="org956842b"><span class="section-number-2">2</span> Thinkpad Trackpoint(小红点)配置</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://wiki.debian.org/InstallingDebianOn/Thinkpad/Trackpoint">Debian WIKI</a>中配置介绍, 不同Debian配置方式有差异. 示例如下:
</p>
<div class="org-src-container">
<pre class="src src-shell">~$ uname -a
Linux t400 3.16.0-4-amd64 #1 SMP Debian 3.16.43-2 (2017-04-30) x86_64 GNU/Linux
~$ su
~# cat &gt; /usr/share/X11/xorg.conf.d/20-thinkpad.conf.1 &lt;&lt;EOF
&gt;  Section "InputClass"
&gt;      Identifier "Trackpoint Wheel Emulation"
&gt;      MatchProduct       "TPPS/2 IBM TrackPoint|DualPoint Stick|Synaptics Inc. Composite TouchPad / TrackPoint|ThinkPad USB Keyboard with TrackPoint|ThinkPad Compact USB Keyboard with TrackPoint|USB Trackpoint pointing device"
&gt;      MatchDevicePath    "/dev/input/event*"
&gt;      Option             "EmulateWheel"          "true"
&gt;      Option             "EmulateWheelButton"    "2"
&gt;      Option             "Emulate3Buttons"       "false"
&gt;      Option             "XAxisMapping"          "6 7"
&gt;      Option             "YAxisMapping"          "4 5"
&gt;  EndSection
&gt; EOF

# comment: save all your X11 work and exit, then restart X11
~# /etc/init.d/gdm3 restart
</pre>
</div>
<p>
<a href="https://wiki.archlinux.org/index.php/TrackPoint">ArchLinux</a>和<a href="http://thinkwiki.org/wiki/How_to_configure_the_TrackPoint">thinkwiki</a>也有介绍. 单击真心不好用. :)
</p>
</div>
</div>
</div>
</body>
</html>
